#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/tadyjp/home-IoT/runs/run-6UQU4mC46hif8A4d

Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_kinesis_stream.soracom_button: Refreshing state... [id=arn:aws:kinesis:ap-northeast-1:188529565947:stream/soracom-button]
aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/soracom_button_to_slack]
aws_iam_role.lambda_kinesis_execution: Refreshing state... [id=lambda-kinesis-execution]
aws_iam_role_policy_attachment.lambda_kinesis_execution: Refreshing state... [id=lambda-kinesis-execution-20220318035103012700000001]
aws_lambda_function.soracom_button_to_slack: Refreshing state... [id=soracom_button_to_slack]
aws_lambda_event_source_mapping.soracom_button_lambda: Refreshing state... [id=ec065c36-7c11-44b2-a922-c35a6664679f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_table.nature_remo_sensor will be created
  + resource "aws_dynamodb_table" "nature_remo_sensor" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "DeviceID"
      + id               = (known after apply)
      + name             = "nature-remo-sensor"
      + range_key        = "Timestamp"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "DeviceID"
          + type = "S"
        }
      + attribute {
          + name = "Timestamp"
          + type = "N"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```
</details>
*Pusher: @tadyjp, Action: `pull_request`*